УправлениеРассылками/src/DataProcessors/Обр1/Обр1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Обр1</name>
</mdclass:DataProcessor>

УправлениеРассылками/src/InformationRegisters/ПротоколОтправки/ПротоколОтправки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПротоколОтправки</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопРезультат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаИВремяОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.Рассылка</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеРассылками/src/InformationRegisters/Очередь/Очередь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Очередь</name>
  <resources>
    <name>УчетнаяЗаписьЭП</name>
    <type>
      <types>CatalogRef.УчётныеЗаписиЭП</types>
    </type>
  </resources>
  <attributes>
    <name>Реквизит</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Рассылка</name>
    <type>
      <types>DocumentRef.Рассылка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеРассылками/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <enumValues>
    <name>ДомашнийАдрес</name>
  </enumValues>
  <enumValues>
    <name>АдресЭП</name>
  </enumValues>
  <enumValues>
    <name>РабочийАдрес</name>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
  </enumValues>
  <enumValues>
    <name>РабочийТелефон</name>
  </enumValues>
</mdclass:Enum>

УправлениеРассылками/src/Enums/СтатусыОтправкиПисьма/СтатусыОтправкиПисьма.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОтправкиПисьма</name>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

УправлениеРассылками/src/DataProcessors/Обр1/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ВыбратьПисьма(Команда)
	ВыбратьПисьмаНаСервере();
КонецПроцедуры

&НаСервере


Функция ПолучитьПрофиль(УчЗапись)
Профиль = Новый ИнтернетПочтовыйПрофиль;
Профиль.АдресСервераSMTP = УчЗапись.СерверSMTP;
Профиль.ПортSMTP = УчЗапись.ПортSMTP;
Профиль.ИспользоватьSSLSMTP = Истина;
Профиль.Пользователь = УчЗапись.АдресЭП;
Профиль.Пароль = УчЗапись.Пароль;
Профиль.ПользовательSMTP = УчЗапись.АдресЭП;
Профиль.ПарольSMTP = УчЗапись.Пароль;
Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
Профиль.ВремяОжидания = 50; 

Возврат Профиль;
КонецФункции


Процедура ОтправитьПисьмо(Почта, Выборка)
	Сообщение = Новый ИнтернетПочтовоеСообщение();
	Сообщение.Отправитель = Выборка.УчетнаяЗаписьЭП.АдресЭП;
	Сообщение.ИмяОтправителя = Выборка.УчетнаяЗаписьЭП.ИмяПриОтправке;


	Адрес = Выборка.Контрагент.КонтактнаяИнформация.Найти(Перечисления.ТипыКонтактнойИнформации.АдресЭП, "Тип").Значение;
	Текст = Выборка.Рассылка.Шаблон.ТекстПисьма;
	Сообщение.Получатели.Добавить(Адрес);
	Сообщение.Тема = Выборка.Рассылка.Шаблон.ТемаПисьма;
	Сообщение.Тексты.Добавить(Текст);
	Сообщение.Тексты.Добавить(Выборка.Рассылка.Шаблон.Подпись);
	ТекстСообщения = Сообщение.Тексты.Добавить();
	ТекстСообщения.Текст = "<a href=""mailto:1cservicesspb@gmail.com"">Отправьте для отписки от рассылки</a>";
	ТекстСообщения.ТипТекста = ТипТекстаПочтовогоСообщения.HTML;
	
	Попытка
	Почта.Послать(Сообщение);
	МенеджерЗаписи = РегистрыСведений.ПротоколОтправки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Контрагент = Выборка.Контрагент;
	МенеджерЗаписи.Рассылка = Выборка.Рассылка;
	МенеджерЗаписи.Статус = Перечисления.СтатусыОтправкиПисьма.Отправлено;
	МенеджерЗаписи.ДатаИВремяОтправки = Дата(ТекущаяДата());
	МенеджерЗаписи.Записать();
	
	МенеджерЗаписи = РегистрыСведений.Очередь.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Контрагент = Выборка.Контрагент;
	МенеджерЗаписи.Рассылка = Выборка.Рассылка;
	МенеджерЗаписи.Удалить();
	Исключение
	Сообщить(ОписаниеОшибки()); 

	Возврат;
	КонецПопытки;
	Сообщить("отправили");
КонецПроцедуры

Процедура ВыбратьПисьмаНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 5
		|	Очередь.Рассылка КАК Рассылка,
		|	Очередь.Контрагент КАК Контрагент,
		|	Очередь.УчетнаяЗаписьЭП КАК УчетнаяЗаписьЭП,
		|	Очередь.ДатаОтправки КАК ДатаОтправки
		|ИЗ
		|	РегистрСведений.Очередь КАК Очередь
		|ГДЕ
		|	Очередь.ДатаОтправки <= &ДатаОтправки
		|ДЛЯ ИЗМЕНЕНИЯ
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОтправки,
		|	Рассылка
		|ИТОГИ
		|	КОЛИЧЕСТВО(Контрагент)
		|ПО
		|	УчетнаяЗаписьЭП";
		
	ДатаОтправки = Дата(ТекущаяДата());
	Запрос.УстановитьПараметр("ДатаОтправки", ДатаОтправки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаУчетнаяЗаписьЭП = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Сообщить(ВыборкаУчетнаяЗаписьЭП.Количество());
	Пока ВыборкаУчетнаяЗаписьЭП.Следующий() Цикл
		Профиль = ПолучитьПрофиль(ВыборкаУчетнаяЗаписьЭП.УчетнаяЗаписьЭП);
		Если (Профиль = 0) Тогда
//			TODO: записать в регистр 
		КонецЕсли;
		Почта = ПодключитьсяКПочте(Профиль);
		
		ВыборкаДетальныеЗаписи = ВыборкаУчетнаяЗаписьЭП.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

			ОтправитьПисьмо(Почта, ВыборкаДетальныеЗаписи);
			Сообщить(ВыборкаДетальныеЗаписи.Контрагент.Отчество);
		КонецЦикла;
		ОтключитьсяОтПочты(Почта);	
	КонецЦикла;
	
	

КонецПроцедуры


Функция ПодключитьсяКПочте(Профиль)	
	Почта = Новый ИнтернетПочта;
	Попытка
	Почта.Подключиться(Профиль);
	Сообщить("Подключение к профилю прошло успешно");
	Исключение
	Сообщить(ОписаниеОшибки()); 
	Возврат 0;
	КонецПопытки;


	Сообщить("Процедура на сервере завершена");
	Возврат Почта;
КонецФункции

Процедура ОтключитьсяОтПочты(Почта)
	Почта.Отключиться(); 
	Сообщить("Отключение от почты");
КонецПроцедуры
